app/controllers/posts_controller.rb

  def create

    # @post = current_user.post.build(post_params)
    @post = Post.new(post_params)

		if @post.save
---
INSERT INTO "posts" ("job_title", "company", "location", "your_name", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["job_title", "111"], ["company", "111"], ["location", "111"], ["your_name", "111"], ["phone", 111], ["created_at", "2017-11-17 19:04:38.447291"], ["updated_at", "2017-11-17 19:04:38.447291"]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "job_title" = $1, "company" = $2, "your_name" = $3, "phone" = $4, "updated_at" = $5 WHERE "posts"."id" = $6  [["job_title", "developer"], ["company", "bc company"], ["your_name", "bella"], ["phone", 123456], ["updated_at", "2017-11-18 19:31:06.466319"], ["id", 2]]

  def destroy
  #  post = current_user.post.find(params[:id])
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]