app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password", "admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "lilu"], ["email", "ll@sfu.ca"], ["password", "12345"], ["admin", "f"], ["created_at", "2017-11-05 20:54:44.530497"], ["updated_at", "2017-11-05 20:54:44.530497"]]